<?php
//8. *Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».
echo "<h1>Задание №8 </h1> ";
$db = [
    'Московская область' => ['Москва', 'Зеленоград', 'Клин'],
    'Ленинградская область' => ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'],
    'Свердловская область' => ['Екатеринбург', 'Каменск-уральский', 'Нижний-Тагил'],
];
foreach ($db as $region => $cities) {
    echo "<b>$region</b> <br>";
    foreach ($cities as $city) {
        if (mb_substr($city, 0 , 1) == 'К') {
            echo "&nbsp; $city <br>";;
        }
    }
}
